Revit 2027 API
PostPattern.CornerPostAngle Property
 The angle between neighboring railing segments which conditions inserting post along a railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CornerPostAngle { get; set; }
Public Property CornerPostAngle As Double
	Get
	Set
public:
property double CornerPostAngle {
	double get ();
	void set (double value);
}
member CornerPostAngle : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for cornerPostAngle is not finite
See Also
Reference
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace